Car_CFD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(   
    (-5 -0.14 0) //0
    (2.5 -0.14 0)  //1
    (2.5  1.86 0) //2
    (-5  1.86 0)  //3
    (-5 -0.14 2)   //4
    (2.5 -0.14 2)  //5
    (2.5  1.86 2)  //6
    (-5  1.86 2)   //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (30 8 8) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    SYM
    {
        type symmetry;
        faces
        (
            (0 1 2 3)
        );
    }
    
    frontAndBack
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (0 3 7 4) 
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 4 5 1)
        );
    }
    upperWall
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
);


// ************************************************************************* //
