Car_CFD/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forceCoeffs1
{
    type            forceCoeffs;

    libs            (forces);

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches         (carGroup);
    rho             rhoInf;      // Indicates incompressible
    rhoInf          1.225;           // Required when rho = rhoInf
    liftDir         (0 1 0);
    dragDir         (1 0 0);
    CofR            (0.2 0 0);  // Axle midpoint on ground
    pitchAxis       (0 0 1);
    magUInf         20;
    lRef            0.54;        // Wheelbase length
    Aref            0.08;        // Estimated
}


// ************************************************************************* //
